[{"text": "very very stupid thing to do. your \"friend\" absolutely had their name and ID recorded. ", "parent_id": "t3_1g3bjv", "is_sub": false, "author_id": "none", "time": "2013-06-11 06:16:11", "pid": "caggf8m", "score": 7}, {"text": "since they didn't call the police on the spot... your friend should be fine.\n\njust out of curiosity.... what did they write the script for?", "parent_id": "t3_1g3bjv", "is_sub": false, "author_id": "9t0po", "time": "2013-06-11 04:46:52", "pid": "cagevo3", "score": 5}, {"text": "If they didn't take it I wouldn't worry too much, but I definitely wouldn't try to use it again... at least not at the same place", "parent_id": "t3_1g3bjv", "is_sub": false, "author_id": "none", "time": "2013-06-11 02:41:50", "pid": "cagbyxc", "score": 3}, {"text": "Trick is to pay a secretary in the docs office to go along with it, Cha Ching ", "parent_id": "t3_1g3bjv", "is_sub": false, "author_id": "none", "time": "2013-06-11 02:54:03", "pid": "cagc9ez", "score": 3}, {"text": "You don't give your ID until you pick up. This should have been a red flag for you, I mean your friend.", "parent_id": "t3_1g3bjv", "is_sub": false, "author_id": "b8vnw", "time": "2013-06-11 13:06:10", "pid": "cagkghf", "score": 2}, {"text": "Your friend should be okay I just wouldn't try that again. Doctors have DEA numbers for tracking how many and what kind of scripts they write that are required when filling any narcotic script and its nearly impossible to do what your friend tried doing and get away with it unless they're trying to fill something stupid like amoxicillin. Being in the business, usually pharmacists call the doctor for new patients with all narcotic scripts as they are mostly required to do so and that pharmacist is risking a lot (their pharmacist license and big fines even if they weren't in on it) filling a bogus script so they are usually pretty cautious especially depending on what kind of narcotic and how many this dumb friend of yours tried to get away with. It's possible that this pharmacist just didn't want to deal with any of the hassle that comes with this type of crime and just let your friend off on a warning but its possible that they input their information into the system and could have made a copy of the written script (and I.d. depending on how long your friend was actually in the pharmacy) if she really wanted to get them in trouble. Since she let him/her walk than it sounds like this was just a warning and your friend will be okay especially since the pharmacist is supposed to call the cops right there and then and not wait until tomorrow just because she had to pick up little Jeffrey from his soccer match. Now your friend just has a worthless stack of paper that they could try selling to some idiot if you know anyone that stupid to try this trick again", "parent_id": "t3_1g3bjv", "is_sub": false, "author_id": "br76a", "time": "2013-06-11 03:30:11", "pid": "cagd5ye", "score": 1}, {"text": "I know someone that did this. Her mom was an addict and worked at a doctor's office as a receptionist and supplied her daughter with the fake scripts. She got methadone and lortab probably a good 8-10 times before they got caught, and when they did get caught the cops picked up her daughter on the spot. I think your friend is OK and it was probably just a warning.", "parent_id": "t3_1g3bjv", "is_sub": false, "author_id": "9n73t", "time": "2013-06-11 08:20:34", "pid": "caghu8i", "score": 0}, {"text": "One of my buddies tired this a couple years ago..\n\nHe went in a dropped off the script, they took it, and when he came back in to pick it up the cops were waiting for him.", "parent_id": "t3_1g3bjv", "is_sub": false, "author_id": "7yswy", "time": "2013-06-11 15:18:34", "pid": "cagmvpd", "score": 0}, {"text": "100 Vikoden 5/500\n150 Perkacette 10/325\nWith like 5 refills each.\n\nThat would be hilarious. Oh, and OP, I agree that your \"friends\" should be fine. But I suggest that you don't hang out with these \"friends\" of yours anymore or as much.....guilty by association is a real thing, and you can be charged with everything that your friends (hypothetically) would be charged with just for being present, or knowing about it. And also, when it comes to controlled substances, especially narcotics, I'm pretty sure every doctor has a special number that they have to write on the script, don't quote me on that though.\n\nAlso, have you guys ever thought about how many people before you have tried this? There is so many security features implemented for prescriptions......it's not like filling out a regular form. \n\nEdit: accidentally threw a random letter right in the beginning . ", "parent_id": "t1_cagevo3", "is_sub": false, "author_id": "7i2ms", "time": "2013-06-11 21:02:43", "pid": "cagvbo8", "score": 1}, {"text": "gotta be IV'd in the same rig.. the whole point of a speedball is the unique rush", "parent_id": "t3_1b5j9v", "is_sub": false, "author_id": "none", "time": "2013-03-28 02:56:28", "pid": "c93ssd7", "score": 8}, {"text": "LOL well if you want to get all TECHNICAL about it, it is strictly defined as an IV shot with both coke and H in it. But anyone who is impressed by this technicality has some serious issues. You are A-OK in my book!! ***thumbs up!***", "parent_id": "t3_1b5j9v", "is_sub": false, "author_id": "7po9t", "time": "2013-03-28 05:50:59", "pid": "c93vujr", "score": 3}, {"text": "do you dissolve the coke in water the same way you do with powder dope?  or is there a difference in preparing coke for IV?", "parent_id": "t3_1b5j9v", "is_sub": false, "author_id": "6x105", "time": "2013-03-28 17:22:33", "pid": "c9443ko", "score": 2}, {"text": "I like to sniff oxy with a bit of Adderall in it. Probably 10-30mg of oxy and 3-8mg of addy.\n\nWhat is the ratio for H and C when performing a speedball?\n\nNever done coke...yet....so i don't know how much to sniff for a first time? And Im sure iving Is much stronger than sniffing so you would need much less.\n\nAny advice on how to start wither coke? Soft.", "parent_id": "t3_1b5j9v", "is_sub": false, "author_id": "5wsqc", "time": "2013-03-28 17:43:20", "pid": "c944iu6", "score": 1}, {"text": "I have heard speed-ball when some one sniffs H and coke/meth at the same time. Never with crack tho. Maybe if you smoked tar and crack at the same time.\n\nIn your case you are just drugged-up not speed ballin' sorry bro.", "parent_id": "t3_1b5j9v", "is_sub": false, "author_id": "8ga5f", "time": "2013-03-28 03:05:04", "pid": "c93syus", "score": 1}, {"text": "I'm doing blow and roxi tonight, but I don't think it's a speedball for two reasons: I'm not banging anything and most importantly I don't have any boy to accompany my girl. Just pharmas.", "parent_id": "t3_1b5j9v", "is_sub": false, "author_id": "7pkgw", "time": "2013-03-28 04:12:42", "pid": "c93u9ts", "score": -1}, {"text": "Gotcha, looks like I won't be doing that then. Thanks for the serious reply.", "parent_id": "t1_c93ssd7", "is_sub": false, "author_id": "afoyu", "time": "2013-03-28 03:07:29", "pid": "c93t0nf", "score": 2}, {"text": "Are you saying that speedballing should be loosely defined? I would disagree because then coffee and codeine could be considered a \"speedball\". The feeling of even snorting both an upper and an opiate at the sametime does not touch the feeling of it IV'd. There really is no way to compare the experiences to say they are even close. Sorry, that excludes all those people that say they were speedballin on their adderall and vicodin. ", "parent_id": "t1_c93vujr", "is_sub": false, "author_id": "71679", "time": "2013-03-28 07:21:57", "pid": "c93wuwi", "score": -1}, {"text": "yeah same way, unless ur dissolving crack in which case you use vineger or some acid", "parent_id": "t1_c9443ko", "is_sub": false, "author_id": "53oz4", "time": "2013-03-29 03:19:39", "pid": "c94fjmw", "score": 1}, {"text": "Mixing H and Meth is called a \"Goofball\"", "parent_id": "t1_c93syus", "is_sub": false, "author_id": "736mp", "time": "2013-03-28 16:54:50", "pid": "c943jfl", "score": 6}, {"text": "All good, still was a great high!", "parent_id": "t1_c93syus", "is_sub": false, "author_id": "afoyu", "time": "2013-03-28 03:07:51", "pid": "c93t0xf", "score": 2}, {"text": "I would consider IV of any hard opiate (H, M, OxyC, OxyM, HydroM) and coke to be a speed ball. Not HydroC though, baby shit", "parent_id": "t1_c93wuwi", "is_sub": false, "author_id": "9vs4g", "time": "2013-03-28 18:04:32", "pid": "c944ycn", "score": 3}, {"text": "nah I'm just saying that you shouldn't worry about what other people think about what you do. I used to think oxy and adderall was like a \"mini speedball\" but you're right, it doesn't compare to it IV'd in a single shot. I'm too broke to afford to speedball anymore cause i go through my H too fast when I do it lol.. ", "parent_id": "t1_c93wuwi", "is_sub": false, "author_id": "7po9t", "time": "2013-03-28 22:29:29", "pid": "c949yei", "score": 2}, {"text": "I've also heard it called a \"California Speedball\" by some--I first saw a mention of this moniker in an Erowid experience report, and I've seen it/heard it called this a few times since.", "parent_id": "t1_c943jfl", "is_sub": false, "author_id": "7grbs", "time": "2013-03-29 20:32:07", "pid": "c94tr6q", "score": 2}, {"text": "No it's not, you're making that up.\n\nGod!   ... I hate that!\n", "parent_id": "t1_c943jfl", "is_sub": false, "author_id": "8ga5f", "time": "2013-03-28 17:38:16", "pid": "c944f64", "score": -5}, {"text": "Hmm.. I've never heard that one.. I wonder why? Cool though, I love finding new slang :D", "parent_id": "t1_c94tr6q", "is_sub": false, "author_id": "736mp", "time": "2013-03-30 02:57:40", "pid": "c950h1p", "score": 1}, {"text": "yeah, except it's not made up", "parent_id": "t1_c944f64", "is_sub": false, "author_id": "6kap4", "time": "2013-03-28 21:38:10", "pid": "c948y9v", "score": 8}, {"text": "I didn't make it up, that was what I was told as a teen... If I am misinformed please take a second to educate me instead of just giving me a hard time.... \n", "parent_id": "t1_c944f64", "is_sub": false, "author_id": "736mp", "time": "2013-03-28 17:44:40", "pid": "c944jsq", "score": 4}, {"text": "It's amazing how many different nicknames one substance can have, depending on where you're located, haha. I too enjoy coming across new slang terms. :)", "parent_id": "t1_c950h1p", "is_sub": false, "author_id": "7grbs", "time": "2013-03-30 03:35:10", "pid": "c95133b", "score": 2}, {"text": "I am pretty sure it's made up.", "parent_id": "t1_c948y9v", "is_sub": false, "author_id": "8ga5f", "time": "2013-03-28 22:42:23", "pid": "c94a7d5", "score": -8}, {"text": "...I knew it!\n\nIt's fine that you made it up, I kinda like it. I just think you should take credit for your hilarious new term. ", "parent_id": "t1_c944jsq", "is_sub": false, "author_id": "8ga5f", "time": "2013-03-28 17:56:25", "pid": "c944sgx", "score": -9}, {"text": "It's called a goofball by every user I've encountered in SF. ", "parent_id": "t1_c94a7d5", "is_sub": false, "author_id": "8uriy", "time": "2013-03-29 09:34:00", "pid": "c94k2of", "score": 5}, {"text": "He didnt make it up.  Meth and dope is a goofball and crack and dope is a snowball. I've heard these terms from dozens of people since I started using, and I fuckn hate uppers.", "parent_id": "t1_c944sgx", "is_sub": false, "author_id": "3m008", "time": "2013-03-28 21:43:17", "pid": "c9491zn", "score": 5}, {"text": "Well, somebody made it up.", "parent_id": "t1_c94k2of", "is_sub": false, "author_id": "8ga5f", "time": "2013-03-29 16:30:46", "pid": "c94oyko", "score": -5}, {"text": "..suuure\n\n[citation needed]", "parent_id": "t1_c9491zn", "is_sub": false, "author_id": "8ga5f", "time": "2013-03-28 22:42:10", "pid": "c94a778", "score": -6}, {"text": "That applies to every word ever", "parent_id": "t1_c94oyko", "is_sub": false, "author_id": "7l09o", "time": "2013-03-29 21:21:05", "pid": "c94upqd", "score": 5}, {"text": "IV heroin and methamphetamine is referred to as a goofball in the PNW.", "parent_id": "t1_c94a778", "is_sub": false, "author_id": "a993v", "time": "2013-03-29 07:25:59", "pid": "c94j6je", "score": 4}, {"text": "I'n not so sure about that one.", "parent_id": "t1_c94upqd", "is_sub": false, "author_id": "8ga5f", "time": "2013-03-29 22:35:28", "pid": "c94w215", "score": -1}, {"text": "PNW?  ..what is that, some thing you made up?", "parent_id": "t1_c94j6je", "is_sub": false, "author_id": "8ga5f", "time": "2013-03-29 16:31:18", "pid": "c94oyxt", "score": -6}, {"text": "... Pacific northwest", "parent_id": "t1_c94oyxt", "is_sub": false, "author_id": "7l09o", "time": "2013-03-29 21:21:50", "pid": "c94uq7n", "score": 3}, {"text": "[deleted]", "parent_id": "t3_1a2hyw", "is_sub": false, "author_id": "none", "time": "2013-03-11 07:16:45", "pid": "c8tiids", "score": 3}, {"text": "PST >>>> Kratom\n\nat least in my opinion... Although I have heard the kratom tinctures can be very nice, but I have only tried the dried leaf never the concentrated tinctures..\n\nFor me PST basically eliminates all withdrawal and even gives a slight buzz all day long, whereas Kratom just tasted nasty and helped minimally with withdrawals", "parent_id": "t3_1a2hyw", "is_sub": false, "author_id": "none", "time": "2013-03-11 08:35:17", "pid": "c8tj5q4", "score": 3}, {"text": "Kratom isn't strong opi feeling wise. Bali strain is the closest I think. Check out /r/kratom . It's good if you're dry but don't expect it to feel like anything more than 20mg oxy", "parent_id": "t3_1a2hyw", "is_sub": false, "author_id": "543dl", "time": "2013-03-11 08:53:05", "pid": "c8tja1q", "score": 2}, {"text": "Headshop Kratom is garbage.  PST is stronger than Kratom and feels more like a \"real opiate.\"  Kratom is a bit buzzy/stimulating compared to PST.", "parent_id": "t3_1a2hyw", "is_sub": false, "author_id": "3e3p2", "time": "2013-03-11 17:04:38", "pid": "c8tou4x", "score": 2}, {"text": "well ive havnt tried pst yet. kratom many time, anywhere from 4-18 grams. its very nice and i dont feel the want to do dope on it.", "parent_id": "t3_1a2hyw", "is_sub": false, "author_id": "none", "time": "2013-03-11 07:43:10", "pid": "c8tir3h", "score": 1}, {"text": "I didn't feel anything on Kratom, even at 15ish grams. ", "parent_id": "t3_1a2hyw", "is_sub": false, "author_id": "ae5fz", "time": "2013-03-12 15:46:12", "pid": "c8u8wic", "score": 1}, {"text": "Ahh that disappointing. In this case, I hope results will vary.", "parent_id": "t1_c8tiids", "is_sub": false, "author_id": "6wec7", "time": "2013-03-11 07:49:02", "pid": "c8tiswu", "score": 1}, {"text": "I strongly agree with all of this. /r/kratom has some better ideas for where to buy. I use Kratomking.com, and buy maeng da (\"Pimp's kratom\"). Extracts and tinctures generally cost more than they're worth. I hate the taste, so I buy powder and cap it.\n\nKratom hits the opiate receptors, but there's a ceiling on its effects. That's bad, becuase you can never get as high as you can with a true opiate, but it's good, because it means it's impossible to OD. (You *might* be able to OD by combining with other depressants like benzos, who knows.)\n\nThe 'buzzy/stimulating' effect is sometimes nice. In SE Asia, people chew it while they're working. Me, I like it for things like lawnmowing and yard work.", "parent_id": "t1_c8tou4x", "is_sub": false, "author_id": "am6jf", "time": "2013-03-11 21:25:41", "pid": "c8ttgac", "score": 2}, {"text": "Ah I see. So very nice in an opiate kind of way?", "parent_id": "t1_c8tir3h", "is_sub": false, "author_id": "6wec7", "time": "2013-03-11 07:48:19", "pid": "c8tisp0", "score": 1}, {"text": "Yeah, till you build a tolerance to it, but Kratom was really really good.  Order it online.  It's both cheaper and way way better.  \n\nPST is good too, but you need to find nice unwashed ones.  Might want to check around for a guy named Tom for this.  ", "parent_id": "t1_c8tisp0", "is_sub": false, "author_id": "3gjvz", "time": "2013-03-11 18:42:22", "pid": "c8tqt5h", "score": 2}, {"text": "at least what ive had its sedating and relaxing", "parent_id": "t1_c8tisp0", "is_sub": false, "author_id": "none", "time": "2013-03-11 08:14:35", "pid": "c8tj0d8", "score": 1}, {"text": "fashoskie brey brey", "parent_id": "t1_c8tqt5h", "is_sub": false, "author_id": "6wec7", "time": "2013-03-11 21:47:44", "pid": "c8ttwrd", "score": -1}]